In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv('Assignment-4 bank.csv')

In [4]:
df.describe()

,age,balance,day,duration,campaign,pdays,previous
count,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000
mean,41.231948,1528.538524,15.658036,371.993818,2.508421,51.330407,0.832557
std,11.913369,3225.413326,8.420740,347.128386,2.722077,108.758282,2.292007
min,18.000000,-6847.000000,1.000000,2.000000,1.000000,-1.000000,0.000000
25%,32.000000,122.000000,8.000000,138.000000,1.000000,-1.000000,0.000000
50%,39.000000,550.000000,15.000000,255.000000,2.000000,-1.000000,0.000000
75%,49.000000,1708.000000,22.000000,496.000000,3.000000,20.750000,1.000000
max,95.000000,81204.000000,31.000000,3881.000000,63.000000,854.000000,58.000000

In [5]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
0,59,admin.,married,secondary,no,2343,yes,no,unknown,5,may,1042,1,-1,0,unknown,yes
1,56,admin.,married,secondary,no,45,no,no,unknown,5,may,1467,1,-1,0,unknown,yes
2,41,technician,married,secondary,no,1270,yes,no,unknown,5,may,1389,1,-1,0,unknown,yes
3,55,services,married,secondary,no,2476,yes,no,unknown,5,may,579,1,-1,0,unknown,yes
4,54,admin.,married,tertiary,no,184,no,no,unknown,5,may,673,2,-1,0,unknown,yes

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11162 entries, 0 to 11161
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        11162 non-null  int64
 1   job        11162 non-null  object
 2   marital    11162 non-null  object
 3   education  11162 non-null  object
 4   default    11162 non-null  object
 5   balance    11162 non-null  int64
 6   housing    11162 non-null  object
 7   loan       11162 non-null  object
 8   contact    11162 non-null  object
 9   day        11162 non-null  int64
 10  month      11162 non-null  object
 11  duration   11162 non-null  int64
 12  campaign   11162 non-null  int64
 13  pdays      11162 non-null  int64
 14  previous   11162 non-null  int64
 15  poutcome   11162 non-null  object
 16  deposit    11162 non-null  object
dtypes: int64(7), object(10)
memory usage: 1.4+ MB

In [8]:
df.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
deposit      0
dtype: int64

In [9]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
df['education']=le.fit_transform(df['education'])
print(df['education'].value_counts())

1    5476
2    3689
0    1500
3     497
Name: education, dtype: int64

In [15]:
df['marital']=le.fit_transform(df['marital'])
print(df['marital'].value_counts())

1    6351
2    3518
0    1293
Name: marital, dtype: int64

In [16]:
df['housing']=le.fit_transform(df['housing'])
print(df['housing'].value_counts())

0    5881
1    5281
Name: housing, dtype: int64

In [12]:
df['education']=le.fit_transform(df['education'])
print(df['education'].value_counts()

SyntaxError: unexpected EOF while parsing (<ipython-input-12-fd17d1edc443>, line 2)

In [17]:
df['contact']=le.fit_transform(df['contact'])
print(df['contact'].value_counts())

0    8042
2    2346
1     774
Name: contact, dtype: int64

In [124]:
df['month']=le.fit_transform(df['month'])
print(df['month'].value_counts())

8     2824
1     1519
5     1514
6     1222
9      943
0      923
3      776
10     392
4      344
11     319
7      276
2      110
Name: month, dtype: int64

In [125]:
df['loan']=le.fit_transform(df['loan'])
print(df['loan'].value_counts())

0    9702
1    1460
Name: loan, dtype: int64

In [22]:
df['poutcome']=le.fit_transform(df['poutcome'])
print(df['poutcome'].value_counts())

3    8326
0    1228
2    1071
1     537
Name: poutcome, dtype: int64

In [23]:
df['deposit']=le.fit_transform(df['deposit'])
print(df['deposit'].value_counts())

0    5873
1    5289
Name: deposit, dtype: int64

In [24]:
y=df.iloc[:,[7,15]]

In [25]:
y.head()

  loan  poutcome
0   no         3
1   no         3
2   no         3
3   no         3
4   no         3

In [26]:
x=df.iloc[:,[5,11]]

In [28]:
x.head()

   balance  duration
0     2343      1042
1       45      1467
2     1270      1389
3     2476       579
4      184       673

In [29]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)
print(x_train.shape)
print(x_test.shape)

(8929, 2)
(2233, 2)

In [30]:
x_train

       balance  duration
10427      141       275
2546       431       343
218        178       732
885       5303       133
3627       705       544
...        ...       ...
4367         0       300
1945         0      1975
9730       633        76
9570      2806       294
8985      3720       561

[8929 rows x 2 columns]

In [36]:
x_test

      balance  duration
314         9       371
4780      567       238
1913       87       477
180        16       638
7745      557        89
...       ...       ...
7983      745        76
9857      402       153
8296     2344       111
7087        0       376
9395      326       115

[2233 rows x 2 columns]